# encoding:utf-8
# 什么是序列类型的数据:列表,元组,字符串都是
# 两个特点,索引操作服和切片操作符

# ----------------------------------------序列类型
print("----------------------------------------序列操作")
# ----序列的基本操作
# ----len() 求序列的长度
str = 'abcde'
print(len(str))
# ----+ 连接两个序列
str2 = '12345'
print(str + str2)
# ----* 重复
print(str2 * 5)
# ----in 存在判断
print('1' in str2)
a = 'ab'
print(a in str)
# ----max 最大值
print(max(str))
print(max(str2))
# ----min 最小值
print(min(str))
print(min(str2))
# ----cmp 比较 相同返回 '0'
print(cmp(str, str2))
print(cmp(str, str))
# ----------------------------------------序列类型
print("----------------------------------------序列类型")
# ----元组 通过圆括号,中间用逗号分隔元素定义,元组和字符串一样是不可变的
# 发展出元组类型是有原因的:
# userinfo = "milo 30 male" 通过这个字符串可以存储一个人的信息
# 但是不太好操作,取出信息,不能当做一个整体,而是通过索引来进行切片操作
# ----定义一个元组,可以存储一系列的值,安全性高
t = ('milo', 30, 'male')
print(t[1:])
# ----定义空元组
t0 = ()
print(type(t0))
# ----定义单元素元组
t1 = (1,)
t2 = (1)
print(type(t1))
print(type(t2))
# ----元组的值无法改变
# t[1] = 31 报错!
